# 1번째 풀이
SELECT COUNT(*) AS COUNT
FROM ECOLI_DATA
WHERE (((GENOTYPE % 8) % 4) DIV 2 != 1) # 2번 형질 미포함
AND NOT(GENOTYPE % 2 != 1 AND ((GENOTYPE % 8) DIV 4 != 1)); # NOT(1번 형질 미포함 AND 3번 형질 미포함)

# 2번째 풀이(비트 연산, 해답 참고)
SELECT COUNT(*) COUNT
FROM ECOLI_DATA
WHERE NOT GENOTYPE & 2
AND GENOTYPE & 5;

-- ----------------------------------------

# 예시: 13
# 8로 나눴을 때 몫:1, 나머지:5 > 4
# 4로 나눴을 때 몫:1, 나머지:1 > 3
# 2로 나눴을 때 몫:0, 나머지:1 > 2
# 1로 나눴을 때 몫:1, 나머지:0 > 1

# 예시: 1
# 8로 나눴을 때 몫:0, 나머지:1
# 4로 나눴을 때 몫:0, 나머지:1
# 2로 나눴을 때 몫:0, 나머지:1
# 1로 나눴을 때 몫:1, 나머지:0

# 예시: 15
# 8로 나눴을 때 몫:1, 나머지:7
# 4로 나눴을 때 몫:1, 나머지:3
# 2로 나눴을 때 몫:1, 나머지:1
# 1로 나눴을 때 몫:1, 나머지:0